<template>
  <v-container>
      <h1 class="text-center display-2 mb-5">Сервіси та розділи</h1>
      <h2 class="text-center title mb-2">Всі сервіси та розділи цього сайту доступні безкоштовно</h2>
      <v-row>
          <v-col class="d-flex flex-column align-center " :xs="12" :sm="12" :md="4" v-for="(item, index) in services" :key="index">
              <v-icon :size="100" :color="item.color">{{item.logo}}</v-icon>
              <h2 class="text-center title">{{item.title}}</h2>
              <p class="text-center">{{item.description}}</p>
          </v-col>
      </v-row>
  </v-container>
</template>

<script>
export default {
  data: () => ({
    services: [
      {
        color: '#333333',
        logo: 'mdi-alert-circle-check-outline',
        title: 'Інформація',
        description: 'За допомогою користувачів платформи ми збираємо інформацію про туризм в Карпатах. Вершини, маршрути, цікаві місця, джерела, колиби та інше. Все, що може знадобитися в поході. В нас є каталоги: місць, сіл та міст, маршрутів.'
      },
      {
        color: '#31708f',
        logo: 'mdi-map-marker-radius-outline',
        title: 'Карта',
        description: 'На основі зібраної інформації ми підтримуємо інтерактивну карту. Із допомогою карти побудова марштуру є значно легшою. Інформація на карті є завжди актуальною та може бути доповнена будь яким учасником спільноти'
      },
      {
        color: 'rgb(51,122,183)',
        logo: 'mdi-cellphone',
        title: 'Мобільні додатки',
        description: 'Ми розробили мобільний додаток для Android. Додаток для iOS буде створено пізніше. Мобільний додаток допоможе орієнтуватися в поході та отримувати інформацію про об`єкти на маршруті, навколишні села та міста, транспорт та ін. Карта та всі дані в додатку працюють, в тому числі ,і без підключення до інтернету. Потрібно лише синхронізувати дані перед походом.'
      },
      {
        color: '#8a6d3b',
        logo: 'mdi-map-marker-path',
        title: 'Маршрути походів',
        description: 'На цьому сайті сформовано каталог маршрутів для походів Карпатами. Це найповніша інтерактивна база маршрутів, інтегрована з базами об`єктів, місць, населених пунктів, транспортної інформації.'
      },
      {
        color: '#3c763d',
        logo: 'mdi-forum',
        title: 'Комунікація',
        description: 'Користувачі веб-сайту та мобільних додатків зможуть спілкуватися між собою. В тому числі під час походу (при наявності інтернету). Сидячи під "Сивулею" можна буде запитати як погода на полонині "Боревка" в того, хто в цей час там і має наш додаток. Спілкування допоможе дізнатися про актуальний стан маршрутів, джерел, колиб, місць таборування та ін'
      },
      {
        color: '#a94442',
        logo: 'mdi-lifebuoy',
        title: 'Допомога',
        description: 'Ми плануємо зберігати та оновлювати інформацію, яка допоможе в екстренних ситуаціях. Можливість попросити про допомогу, в тому числі через СМС якщо немає інтернету, але є мобільний зв`язок. Ми плануємо долучити рятувальників до користування нашими додатками та веб сайтом.'
      }
    ]
  })
}
</script>

<style>

</style>