export default {
    state: {
        places: [
            {
                id: 1,
                categoryId: 2,
                title: 'Говерла',
                info: 'Говерла - найвища вершина України, її висота сягає 2061 м над р.м. Говерла знаходиться на межі Івано-Франківської та Закарпатської областей, а отже входить до Карпатського біосферного заповідника та Карпатського національного природного парку одночасно і охороняється ними обома. Схили гори зачаровують буковими і смерековими лісами, їх тиша та спокій допомагають відчути карпатський дух та єднаннс з природою. У лісових хащах можна зустріти безліч тварин, деякі види навіть занесено до Червоної книги України.',
                massif: 1,
                height: 2061,
                location: null,
                transportHub: false,
                railwayConnection: false,
                tourCity: false,
                publicTransport: false,
                creator: 'admin',
                creationDate: Date.now(),
                lt: 48.078035934756294,
                lg: 24.44936513900757,
                image: 'https://karpaty.love/uploads/posts/2018-02/1517479038_goverla-3.jpg'
            },
            {
                id: 2,
                categoryId: 2,
                title: 'Лезещина',
                info: 'Говерла - найвища вершина України, її висота сягає 2061 м над р.м. Говерла знаходиться на межі Івано-Франківської та Закарпатської областей, а отже входить до Карпатського біосферного заповідника та Карпатського національного природного парку одночасно і охороняється ними обома. Схили гори зачаровують буковими і смерековими лісами, їх тиша та спокій допомагають відчути карпатський дух та єднаннс з природою. У лісових хащах можна зустріти безліч тварин, деякі види навіть занесено до Червоної книги України.',
                massif: 'Чорногора',
                height: 2061,
                features: null,
                transportHub: false,
                railwayConnection: false,
                tourCity: false,
                publicTransport: false,
                creator: 'admin',
                creationDate: Date.now(),
                lt: 48.078035934756294,
                lg: 24.44936513900757,
                image: 'https://www.kalipsoua.com/wp-content/uploads/20170607_1664644203.jpg'
            },
            {
                id: 3,
                categoryId: 2,
                title: 'Говерла',
                info: 'Говерла - найвища вершина України, її висота сягає 2061 м над р.м. Говерла знаходиться на межі Івано-Франківської та Закарпатської областей, а отже входить до Карпатського біосферного заповідника та Карпатського національного природного парку одночасно і охороняється ними обома. Схили гори зачаровують буковими і смерековими лісами, їх тиша та спокій допомагають відчути карпатський дух та єднаннс з природою. У лісових хащах можна зустріти безліч тварин, деякі види навіть занесено до Червоної книги України.',
                massif: 'Чорногора',
                height: 2061,
                features: null,
                transportHub: false,
                railwayConnection: false,
                tourCity: false,
                publicTransport: false,
                creator: 'admin',
                creationDate: Date.now(),
                lt: 48.078035934756294,
                lg: 24.44936513900757,
                image: 'https://cdn.vuetifyjs.com/images/cards/docks.jpg'
            }
        ]
    },
    getters: {
        getPlaces: (state) => state.places
    }
}