export default {
    state: {
        routes: [
            {
                id: 1,
                image: 'https://media.dyvys.info/2017/05/mountains-1366x768-006.jpg',
                identifier: 'blue',
                path: 'Заросляк - оз. Несамовите',
                description: 'Популярний маршрут на оз. Несамовите',
                text: 'Популярний маршрут вихідного дня. До одного з найвідоміших озер Карпат. Починається від туристичної бази Заросляк. Озеро Несамовите знаходиться на Чорногірському хребті. Це легкий маршрут, який без проблем пройдуть навіть діти. Відстань вказана в один бік. Від Заросляка до озера. Врахуйте таку саму відстань в зворотньому напрямку. Як і час на зворотню дорогу.',
                distance: 7.1,
                duration: 4,
                level: 'Початківець',
                start: 'Ворохта',
                startLt: 48.078035934756294,
                startLg: 24.44936513900757,
                endLt: 48.289361048356454,
                endLg: 24.561996459960938,
                geoJson: require('./geoJson')
            },
            {
                id: 2,
                image: 'https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/%D0%93%D0%BE%D1%80%D0%B8_%D0%B2_%D0%BE%D0%BA%D0%BE%D0%BB%D0%B8%D1%86%D1%8F%D1%85_%D0%94%D1%80%D0%B0%D0%B3%D0%BE%D0%B1%D1%80%D0%B0%D1%82%D1%83.jpg/263px-%D0%93%D0%BE%D1%80%D0%B8_%D0%B2_%D0%BE%D0%BA%D0%BE%D0%BB%D0%B8%D1%86%D1%8F%D1%85_%D0%94%D1%80%D0%B0%D0%B3%D0%BE%D0%B1%D1%80%D0%B0%D1%82%D1%83.jpg',
                identifier: 'blue',
                path: 'Заросляк - оз. Несамовите',
                description: 'Популярний маршрут на оз. Несамовите',
                text: 'Популярний маршрут вихідного дня. До одного з найвідоміших озер Карпат. Починається від туристичної бази Заросляк. Озеро Несамовите знаходиться на Чорногірському хребті. Це легкий маршрут, який без проблем пройдуть навіть діти. Відстань вказана в один бік. Від Заросляка до озера. Врахуйте таку саму відстань в зворотньому напрямку. Як і час на зворотню дорогу.',
                distance: 7.1,
                duration: 4,
                level: 'Початківець',
                start: 'Ворохта',
            },
            {
                id: 3,
                image: 'https://cdn.vuetifyjs.com/images/cards/sunshine.jpg',
                identifier: 'blue',
                path: 'Заросляк - оз. Несамовите',
                description: 'Популярний маршрут на оз. Несамовите',
                text: 'Популярний маршрут вихідного дня. До одного з найвідоміших озер Карпат. Починається від туристичної бази Заросляк. Озеро Несамовите знаходиться на Чорногірському хребті. Це легкий маршрут, який без проблем пройдуть навіть діти. Відстань вказана в один бік. Від Заросляка до озера. Врахуйте таку саму відстань в зворотньому напрямку. Як і час на зворотню дорогу.',
                distance: 7.1,
                duration: 4,
                level: 'Початківець',
                start: 'Ворохта',
            },
            {
                id: 4,
                image: 'https://cdn.vuetifyjs.com/images/cards/sunshine.jpg',
                identifier: 'blue',
                path: 'Заросляк - оз. Несамовите',
                description: 'Популярний маршрут на оз. Несамовите',
                text: 'Популярний маршрут вихідного дня. До одного з найвідоміших озер Карпат. Починається від туристичної бази Заросляк. Озеро Несамовите знаходиться на Чорногірському хребті. Це легкий маршрут, який без проблем пройдуть навіть діти. Відстань вказана в один бік. Від Заросляка до озера. Врахуйте таку саму відстань в зворотньому напрямку. Як і час на зворотню дорогу.',
                distance: 7.1,
                duration: 4,
                level: 'Початківець',
                start: 'Ворохта',
            },
        ]
    },
    getters: {
        getRoutes: (state) => state.routes
    }
}